# ASSIGNMENT 2 
**Topic: Chapter 3 & Chapter 4**
- Due: 1st June 2024
- Mode: Individual Assignment
- Submission: E-Learning

### QUESTION 1


Given a raw data of the record of the attendance for 15 employees in a company for a 14 days event. The exported raw data is recorded in following way:

<br>
<center>Figure 1</center>
<img src="Figure 1.png", style="width: 350px";>

(i) Read the “Attendance_RAW.txt” and save the data into a NumPy array.

In [2]:
# WRITE YOUR CODE HERE

import numpy as np

path = 'Attendance_RAW.txt'

with open(path) as file:
    #data = file.readlines()
    data = [line.rstrip() for line in file]

arr1 = np.array(data, dtype = 'int32')
arr1

array([1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0,
       1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0,
       0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0,
       0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0,
       1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1,
       1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1,
       1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0,
       1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 1])

(ii) Shape the NumPy array to a structure where row represents the employees, column represents the working days.

In [2]:
# WRITE YOUR CODE HERE

arr1 = arr1.reshape((15,14))
arr1

array([[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
       [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1],
       [1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1],
       [1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1],
       [1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1],
       [1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1],
       [1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1],
       [0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0],
       [0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 1],
       [0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0],
       [0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0],
       [1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1],
       [0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1],
       [1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 1]])

In [3]:
# checking the shape, dimension and data type of arr1

print(arr1.shape)   # shape
print(arr1.ndim)    # dimension
print(arr1.dtype)   # data type

(15, 14)
2
int32

(iii) Construct a function that can calculate and return the list of average of attendance for each day.

In [32]:

def avrg_attendance(workers):
    day_avg = workers.mean(axis=1)
    for i in range(15):
        #print("The average attendance for Day " + str(i) + " is " + str(day_avg[i])) # without rounding up 2 decimal places
        print(f"The average attendance for Day {i+1} is {day_avg[i]:.4f} ({day_avg[i]*100:.2f}%)")            # rounding up 2 decimal places

In [33]:
# Testing the function

avrg_attendance(arr1)

The average attendance for Day 1 is 1.0000 (100.00%)
The average attendance for Day 2 is 0.8571 (85.71%)
The average attendance for Day 3 is 0.7143 (71.43%)
The average attendance for Day 4 is 0.7857 (78.57%)
The average attendance for Day 5 is 0.5000 (50.00%)
The average attendance for Day 6 is 0.8571 (85.71%)
The average attendance for Day 7 is 0.7143 (71.43%)
The average attendance for Day 8 is 0.6429 (64.29%)
The average attendance for Day 9 is 0.7143 (71.43%)
The average attendance for Day 10 is 0.6429 (64.29%)
The average attendance for Day 11 is 0.7857 (78.57%)
The average attendance for Day 12 is 0.9286 (92.86%)
The average attendance for Day 13 is 0.7143 (71.43%)
The average attendance for Day 14 is 0.7857 (78.57%)
The average attendance for Day 15 is 0.6429 (64.29%)

### QUESTION 2

(i) Create a NumPy array like below:

<br>
<img src="Output2.png", style="width: 200px", align="left";>

In [8]:
# WRITE YOUR CODE HERE

data2 = [[33, 22, 11], [55, 66, 44],[99, 88, 77]]
arr2 = np.array(data2)
arr2

array([[33, 22, 11],
       [55, 66, 44],
       [99, 88, 77]])

(ii) Sort the array given in ascending order.

In [9]:
# WRITE YOUR CODE HERE

arr2.sort()
arr2

array([[11, 22, 33],
       [44, 55, 66],
       [77, 88, 99]])

(iii) Compute sum of all elements, sum of each column and sum of each row of the sorted array.

In [10]:
# WRITE YOUR CODE HERE

print("The sum of all elements is: " + str(arr2.sum()))
print()

rows = []
rows = arr2.sum(axis=1)
for i in range(3):
    print("The sum of row " + str(i) + " is: " + str(rows[i]))

print()
cols = []
cols = arr2.sum(axis=0)
for i in range(3):
    print("The sum of column " + str(i) + " is: " + str(cols[i]))

The sum of all elements is: 495

The sum of row 0 is: 66
The sum of row 1 is: 165
The sum of row 2 is: 264

The sum of column 0 is: 132
The sum of column 1 is: 165
The sum of column 2 is: 198

In [11]:
arr2

array([[11, 22, 33],
       [44, 55, 66],
       [77, 88, 99]])

(iv) Compute mean of all elements, mean of each column and mean of each row of the sorted array.

In [12]:
# WRITE YOUR CODE HERE

print("The mean of all elements is: " + str(arr2.mean()))
print()

rows = []
rows = arr2.mean(axis=1)
for i in range(3):
    print("The mean of row " + str(i) + " is: " + str(rows[i]))

print()
cols = []
cols = arr2.mean(axis=0)
for i in range(3):
    print("The mean of column " + str(i) + " is: " + str(cols[i]))

The mean of all elements is: 55.0

The mean of row 0 is: 22.0
The mean of row 1 is: 55.0
The mean of row 2 is: 88.0

The mean of column 0 is: 44.0
The mean of column 1 is: 55.0
The mean of column 2 is: 66.0

In [13]:
arr2

array([[11, 22, 33],
       [44, 55, 66],
       [77, 88, 99]])

(v) Compute cumulative sum of each column and cumulative product of each row of the given array.

In [14]:
# WRITE YOUR CODE HERE

rows = []
rows = arr2.cumprod(axis=1)
for i in range(3):
    print("The cumulative product of row " + str(i) + " is: " + str(rows[i]))

print()
cols = []
cols = arr2.cumsum(axis=0)
for i in range(3):
    print("The cumulative sum of column " + str(i) + " is: " + str(cols[i]))

The cumulative product of row 0 is: [  11  242 7986]
The cumulative product of row 1 is: [    44   2420 159720]
The cumulative product of row 2 is: [    77   6776 670824]

The cumulative sum of column 0 is: [11 22 33]
The cumulative sum of column 1 is: [55 77 99]
The cumulative sum of column 2 is: [132 165 198]

### QUESTION 3
For this question, you are using Automobile Dataset. 

(i) Load the dataset into pandas dataframe.

In [15]:
# WRITE YOUR CODE HERE

import pandas as pd

df = pd.read_csv('Automobile Dataset.csv')
df

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
...,...,...,...,...,...,...,...,...,...,...
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

(ii) Display the first and last 5 rows.

In [16]:
# WRITE YOUR CODE HERE (for the first 5 rows)

df.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [17]:
# WRITE YOUR CODE HERE (for the last 5 rows)

df.tail()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

In [18]:
# replace all NaN values to 0
df.fillna(0, inplace= True)

# checking the first 25 rows - 2 rows containing NaN values changed to 0
df.head(25)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
5,5,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0
6,6,audi,wagon,105.8,192.7,ohc,five,110,19,18920.0
7,9,bmw,sedan,101.2,176.8,ohc,four,101,23,16430.0
8,10,bmw,sedan,101.2,176.8,ohc,four,101,23,16925.0
9,11,bmw,sedan,101.2,176.8,ohc,six,121,21,20970.0
10,13,bmw,sedan,103.5,189.0,ohc,six,182,16,30760.0
11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
12,15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0
13,16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
14,17,chevrolet,hatchback,94.5,155.9,ohc,four,70,38,6295.0
15,18,chevrolet,sedan,94.5,158.8,ohc,four,70,38,6575.0
16,19,dodge,hatchback,93.7,157.3,ohc,four,68,31,6377.0
17,20,dodge,hatchback,93.7,157.3,ohc,four,68,31,6229.0
18,27,honda,wagon,96.5,157.1,ohc,four,76,30,7295.0
19,28,honda,sedan,96.5,175.4,ohc,four,101,24,12945.0
20,29,honda,sedan,96.5,169.1,ohc,four,100,25,10345.0
21,30,isuzu,sedan,94.3,170.7,ohc,four,78,24,6785.0
22,31,isuzu,sedan,94.5,155.9,ohc,four,70,38,0.0
23,32,isuzu,sedan,94.5,155.9,ohc,four,70,38,0.0
24,33,jaguar,sedan,113.0,199.6,dohc,six,176,15,32250.0

(iii) Print most expensive car’s company name and price.

In [19]:
# WRITE YOUR CODE HERE

# sort the price descending, find the index row that has the highest price; 35

df.sort_values(by=['price'], ascending=False)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
34,46,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
46,62,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
12,15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0
...,...,...,...,...,...,...,...,...,...,...
27,36,mazda,hatchback,93.1,159.1,ohc,four,68,30,5195.0
13,16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
47,63,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,0.0
22,31,isuzu,sedan,94.5,155.9,ohc,four,70,38,0.0
23,32,isuzu,sedan,94.5,155.9,ohc,four,70,38,0.0

In [20]:
# print index 35

df.loc[35, ['company','price']]

company    mercedes-benz
price            45400.0
Name: 35, dtype: object

In [ ]:
df.describe()

In [ ]:
df

(iv) Count total cars per company.

In [21]:
# WRITE YOUR CODE HERE

df.groupby('company').count()['index']

company
alfa-romero      3
audi             4
bmw              6
chevrolet        3
dodge            2
honda            3
isuzu            3
jaguar           3
mazda            5
mercedes-benz    4
mitsubishi       4
nissan           5
porsche          3
toyota           7
volkswagen       4
volvo            2
Name: index, dtype: int64

In [24]:
# get the dataframe for toyota only

toyota_df = df[df['company']=='toyota']
toyota_df

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
52,70,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
53,71,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

(v) Select only Toyota's cars. Find the average mileage and price of Toyota's cars.

In [25]:
# WRITE YOUR CODE HERE

mileage_mean = toyota_df['average-mileage'].mean()
price_mean = toyota_df['price'].mean()

print(f"The average mileage for Toyota is {mileage_mean:.2f} and the average price is ${price_mean:.2f}")

The average mileage for Toyota is 28.71 and the average price is $8216.86

(vi) Sort all cars by Price and Horsepower column. List the expensive cars first.

In [34]:
# sorting by price column
df.sort_values(by=['price', 'horsepower'], ascending=False)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
34,46,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
46,62,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
12,15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0
...,...,...,...,...,...,...,...,...,...,...
27,36,mazda,hatchback,93.1,159.1,ohc,four,68,30,5195.0
13,16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
47,63,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,0.0
22,31,isuzu,sedan,94.5,155.9,ohc,four,70,38,0.0
23,32,isuzu,sedan,94.5,155.9,ohc,four,70,38,0.0

(vii) Display all the maximum car price for each company.

In [38]:
# WRITE YOUR CODE HERE

df.groupby('company').max()['price']

company
alfa-romero      16500.0
audi             18920.0
bmw              41315.0
chevrolet         6575.0
dodge             6377.0
honda            12945.0
isuzu             6785.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mitsubishi        8189.0
nissan           13499.0
porsche          37028.0
toyota           15750.0
volkswagen        9995.0
volvo            13415.0
Name: price, dtype: float64

### QUESTION 4


Given a data file, “emp_detail.csv” which consists of the employee’s details - name and department.

<br>
<img src="Figure 2.png", style="width: 250px";>

(i) Using Pandas library, read the CSV data file in Python into a variable ``emp_detail``.

In [39]:
# WRITE YOUR CODE HERE

emp_detail = pd.read_csv('emp_detail.csv')
emp_detail

       Name Department
0       ALI    FINANCE
1     AHMAD   STAFFING
2     CHONG    FINANCE
3    DARREN   STAFFING
4   JASMINE   STAFFING
5    JOSHUA   STAFFING
6     KELLY    FINANCE
7       LIM    FINANCE
8   NATASHA    FINANCE
9      OMAR   STAFFING
10   PATRIC   STAFFING
11     ROSE   STAFFING
12    SATYA   STAFFING
13    TARIQ   STAFFING
14    USMAN   STAFFING

(ii) Display the first five rows of records of the data read in Step (i).

In [40]:
# WRITE YOUR CODE HERE

emp_detail.head()

      Name Department
0      ALI    FINANCE
1    AHMAD   STAFFING
2    CHONG    FINANCE
3   DARREN   STAFFING
4  JASMINE   STAFFING

(iii) Using the NumPy object of the attendance record created earlier:<br>
            a.	Convert the NumPy object into Data Frame, name it attendance.<br>
            b.	Merge the Data Frames ``emp_detail`` and attendance into a new data frame, name it ``emp_attendance``.

In [41]:
# WRITE YOUR CODE HERE

attendance = pd.DataFrame(arr1)
attendance.columns = np.arange(1, len(attendance))
attendance

    1   2   3   4   5   6   7   8   9   10  11  12  13  14
0    1   1   1   1   1   1   1   1   1   1   1   1   1   1
1    0   1   1   1   1   1   1   1   1   1   0   1   1   1
2    1   1   1   1   1   1   0   1   0   0   1   1   0   1
3    1   0   1   1   0   1   1   1   1   0   1   1   1   1
4    1   0   0   0   1   1   1   1   0   0   0   0   1   1
5    1   1   1   1   1   1   1   1   0   1   1   1   0   1
6    1   1   1   0   0   1   1   1   0   1   1   0   1   1
7    0   0   1   1   1   1   1   1   1   1   0   0   1   0
8    0   1   1   1   1   0   1   0   1   1   0   1   1   1
9    0   1   0   1   0   1   1   1   1   1   1   0   1   0
10   0   0   0   1   1   1   1   1   1   1   1   1   1   1
11   1   1   1   1   1   1   1   1   1   1   1   1   1   0
12   1   1   0   0   0   0   1   1   1   1   1   1   1   1
13   0   0   1   1   1   1   1   1   1   1   1   1   0   1
14   1   0   1   1   1   0   0   0   1   0   1   1   1   1

In [70]:
# Merge the Data Frames emp_detail and attendance into a new data frame, name it emp_attendance.

emp_attendance = pd.concat([emp_detail, attendance], axis=1)

emp_attendance

       Name Department  1  2  3  4  5  6  7  8  9  10  11  12  13  14
0       ALI    FINANCE  1  1  1  1  1  1  1  1  1   1   1   1   1   1
1     AHMAD   STAFFING  0  1  1  1  1  1  1  1  1   1   0   1   1   1
2     CHONG    FINANCE  1  1  1  1  1  1  0  1  0   0   1   1   0   1
3    DARREN   STAFFING  1  0  1  1  0  1  1  1  1   0   1   1   1   1
4   JASMINE   STAFFING  1  0  0  0  1  1  1  1  0   0   0   0   1   1
5    JOSHUA   STAFFING  1  1  1  1  1  1  1  1  0   1   1   1   0   1
6     KELLY    FINANCE  1  1  1  0  0  1  1  1  0   1   1   0   1   1
7       LIM    FINANCE  0  0  1  1  1  1  1  1  1   1   0   0   1   0
8   NATASHA    FINANCE  0  1  1  1  1  0  1  0  1   1   0   1   1   1
9      OMAR   STAFFING  0  1  0  1  0  1  1  1  1   1   1   0   1   0
10   PATRIC   STAFFING  0  0  0  1  1  1  1  1  1   1   1   1   1   1
11     ROSE   STAFFING  1  1  1  1  1  1  1  1  1   1   1   1   1   0
12    SATYA   STAFFING  1  1  0  0  0  0  1  1  1   1   1   1   1   1
13    TARIQ   STAFFING  0  0  1  1  1  1  1  1  1   1   1   1   0   1
14    USMAN   STAFFING  1  0  1  1  1  0  0  0  1   0   1   1   1   1

(iv) Add a column with name ``total`` into the ``emp_attendance`` Data Frame that consists of the total no. of days the employee attended the event.

In [71]:
# WRITE YOUR CODE HERE

emp_attendance['total'] = attendance.sum(axis=1)
emp_attendance

       Name Department  1  2  3  4  5  6  7  8  9  10  11  12  13  14  total
0       ALI    FINANCE  1  1  1  1  1  1  1  1  1   1   1   1   1   1     14
1     AHMAD   STAFFING  0  1  1  1  1  1  1  1  1   1   0   1   1   1     12
2     CHONG    FINANCE  1  1  1  1  1  1  0  1  0   0   1   1   0   1     10
3    DARREN   STAFFING  1  0  1  1  0  1  1  1  1   0   1   1   1   1     11
4   JASMINE   STAFFING  1  0  0  0  1  1  1  1  0   0   0   0   1   1      7
5    JOSHUA   STAFFING  1  1  1  1  1  1  1  1  0   1   1   1   0   1     12
6     KELLY    FINANCE  1  1  1  0  0  1  1  1  0   1   1   0   1   1     10
7       LIM    FINANCE  0  0  1  1  1  1  1  1  1   1   0   0   1   0      9
8   NATASHA    FINANCE  0  1  1  1  1  0  1  0  1   1   0   1   1   1     10
9      OMAR   STAFFING  0  1  0  1  0  1  1  1  1   1   1   0   1   0      9
10   PATRIC   STAFFING  0  0  0  1  1  1  1  1  1   1   1   1   1   1     11
11     ROSE   STAFFING  1  1  1  1  1  1  1  1  1   1   1   1   1   0     13
12    SATYA   STAFFING  1  1  0  0  0  0  1  1  1   1   1   1   1   1     10
13    TARIQ   STAFFING  0  0  1  1  1  1  1  1  1   1   1   1   0   1     11
14    USMAN   STAFFING  1  0  1  1  1  0  0  0  1   0   1   1   1   1      9

(v) Add a column with name ``rate`` into the ``emp_attendance`` Data Frame that consists of the attendance rate / percentage the employee throughout the 14 days.

In [72]:
# WRITE YOUR CODE HERE

emp_attendance['rate'] = np.around(((attendance.sum(axis=1))/14)*100,2)
emp_attendance

,Name,Department,1,2,3,4,5,6,7,8,9,10,11,12,13,14,total,rate
0,ALI,FINANCE,1,1,1,1,1,1,1,1,1,1,1,1,1,1,14,100.00
1,AHMAD,STAFFING,0,1,1,1,1,1,1,1,1,1,0,1,1,1,12,85.71
2,CHONG,FINANCE,1,1,1,1,1,1,0,1,0,0,1,1,0,1,10,71.43
3,DARREN,STAFFING,1,0,1,1,0,1,1,1,1,0,1,1,1,1,11,78.57
4,JASMINE,STAFFING,1,0,0,0,1,1,1,1,0,0,0,0,1,1,7,50.00
5,JOSHUA,STAFFING,1,1,1,1,1,1,1,1,0,1,1,1,0,1,12,85.71
6,KELLY,FINANCE,1,1,1,0,0,1,1,1,0,1,1,0,1,1,10,71.43
7,LIM,FINANCE,0,0,1,1,1,1,1,1,1,1,0,0,1,0,9,64.29
8,NATASHA,FINANCE,0,1,1,1,1,0,1,0,1,1,0,1,1,1,10,71.43
9,OMAR,STAFFING,0,1,0,1,0,1,1,1,1,1,1,0,1,0,9,64.29
10,PATRIC,STAFFING,0,0,0,1,1,1,1,1,1,1,1,1,1,1,11,78.57
11,ROSE,STAFFING,1,1,1,1,1,1,1,1,1,1,1,1,1,0,13,92.86
12,SATYA,STAFFING,1,1,0,0,0,0,1,1,1,1,1,1,1,1,10,71.43
13,TARIQ,STAFFING,0,0,1,1,1,1,1,1,1,1,1,1,0,1,11,78.57
14,USMAN,STAFFING,1,0,1,1,1,0,0,0,1,0,1,1,1,1,9,64.29

(vi) Consider following rules in classify the attendance:<br>
        a.	Rate > 90% : Good <br>
        b.	60% < Rate < 90% : Moderate <br>
        c.	Rate < 60% : Bad <br>
    Based on the grouping rule above, get the status for each of the staff and save the status in a new column ``status`` in the Data Frame.

In [73]:
# WRITE YOUR CODE HERE

def emp_status(row):
    if row['rate'] > 90:
        stat = 'Good'
    elif (row['rate'] > 60) & (row['rate'] < 90):
        stat = 'Moderate'
    else:
        stat = 'Bad'
        
    return stat

In [66]:
emp_attendance['status'] = emp_attendance.apply(emp_status, axis=1)
emp_attendance

,Name,Department,1,2,3,4,5,6,7,8,9,10,11,12,13,14,total,rate,status
0,ALI,FINANCE,1,1,1,1,1,1,1,1,1,1,1,1,1,1,14,100.00,Good
1,AHMAD,STAFFING,0,1,1,1,1,1,1,1,1,1,0,1,1,1,12,85.71,Moderate
2,CHONG,FINANCE,1,1,1,1,1,1,0,1,0,0,1,1,0,1,10,71.43,Moderate
3,DARREN,STAFFING,1,0,1,1,0,1,1,1,1,0,1,1,1,1,11,78.57,Moderate
4,JASMINE,STAFFING,1,0,0,0,1,1,1,1,0,0,0,0,1,1,7,50.00,Bad
5,JOSHUA,STAFFING,1,1,1,1,1,1,1,1,0,1,1,1,0,1,12,85.71,Moderate
6,KELLY,FINANCE,1,1,1,0,0,1,1,1,0,1,1,0,1,1,10,71.43,Moderate
7,LIM,FINANCE,0,0,1,1,1,1,1,1,1,1,0,0,1,0,9,64.29,Moderate
8,NATASHA,FINANCE,0,1,1,1,1,0,1,0,1,1,0,1,1,1,10,71.43,Moderate
9,OMAR,STAFFING,0,1,0,1,0,1,1,1,1,1,1,0,1,0,9,64.29,Moderate
10,PATRIC,STAFFING,0,0,0,1,1,1,1,1,1,1,1,1,1,1,11,78.57,Moderate
11,ROSE,STAFFING,1,1,1,1,1,1,1,1,1,1,1,1,1,0,13,92.86,Good
12,SATYA,STAFFING,1,1,0,0,0,0,1,1,1,1,1,1,1,1,10,71.43,Moderate
13,TARIQ,STAFFING,0,0,1,1,1,1,1,1,1,1,1,1,0,1,11,78.57,Moderate
14,USMAN,STAFFING,1,0,1,1,1,0,0,0,1,0,1,1,1,1,9,64.29,Moderate

In [74]:
# Another way: using list comprehension

emp_attendance["Status"] = ["Bad" if s < 60 else "Moderate" if ((s>60) & (s<90)) else "Good" for s in emp_attendance["rate"]]
emp_attendance

,Name,Department,1,2,3,4,5,6,7,8,9,10,11,12,13,14,total,rate,Status
0,ALI,FINANCE,1,1,1,1,1,1,1,1,1,1,1,1,1,1,14,100.00,Good
1,AHMAD,STAFFING,0,1,1,1,1,1,1,1,1,1,0,1,1,1,12,85.71,Moderate
2,CHONG,FINANCE,1,1,1,1,1,1,0,1,0,0,1,1,0,1,10,71.43,Moderate
3,DARREN,STAFFING,1,0,1,1,0,1,1,1,1,0,1,1,1,1,11,78.57,Moderate
4,JASMINE,STAFFING,1,0,0,0,1,1,1,1,0,0,0,0,1,1,7,50.00,Bad
5,JOSHUA,STAFFING,1,1,1,1,1,1,1,1,0,1,1,1,0,1,12,85.71,Moderate
6,KELLY,FINANCE,1,1,1,0,0,1,1,1,0,1,1,0,1,1,10,71.43,Moderate
7,LIM,FINANCE,0,0,1,1,1,1,1,1,1,1,0,0,1,0,9,64.29,Moderate
8,NATASHA,FINANCE,0,1,1,1,1,0,1,0,1,1,0,1,1,1,10,71.43,Moderate
9,OMAR,STAFFING,0,1,0,1,0,1,1,1,1,1,1,0,1,0,9,64.29,Moderate
10,PATRIC,STAFFING,0,0,0,1,1,1,1,1,1,1,1,1,1,1,11,78.57,Moderate
11,ROSE,STAFFING,1,1,1,1,1,1,1,1,1,1,1,1,1,0,13,92.86,Good
12,SATYA,STAFFING,1,1,0,0,0,0,1,1,1,1,1,1,1,1,10,71.43,Moderate
13,TARIQ,STAFFING,0,0,1,1,1,1,1,1,1,1,1,1,0,1,11,78.57,Moderate
14,USMAN,STAFFING,1,0,1,1,1,0,0,0,1,0,1,1,1,1,9,64.29,Moderate

(vii) Construct a function that returns the average attendance of all staff over the 14 days according to the department.

In [75]:
# WRITE YOUR CODE HERE

def ave_attendance(employers):
    #Attendance = employers.drop(['Name', 'Department'], axis=1)
    return(employers['total'].sum())

In [76]:
average = ( ave_attendance(emp_attendance) / (14*15) ) * 100

print(f"The average attendance of all staff over 14 days is {average:.2f}% ")

The average attendance of all staff over 14 days is 75.24%